LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
#ifndef __AW_PID_2071_REG_H__
#define __AW_PID_2071_REG_H__

/* registers list */
#define AW_PID_2071_ID_REG		(0x00)
#define AW_PID_2071_SYSST_REG		(0x01)
#define AW_PID_2071_SYSINT_REG		(0x02)
#define AW_PID_2071_SYSINTM_REG		(0x03)
#define AW_PID_2071_SYSCTRL_REG		(0x04)
#define AW_PID_2071_SYSCTRL2_REG	(0x05)
#define AW_PID_2071_I2SCTRL_REG		(0x06)
#define AW_PID_2071_I2SCFG1_REG		(0x07)
#define AW_PID_2071_I2SCFG2_REG		(0x08)
#define AW_PID_2071_HAGCCFG1_REG	(0x09)
#define AW_PID_2071_HAGCCFG2_REG	(0x0A)
#define AW_PID_2071_HAGCCFG3_REG	(0x0B)
#define AW_PID_2071_HAGCCFG4_REG	(0x0C)
#define AW_PID_2071_HAGCCFG5_REG	(0x0D)
#define AW_PID_2071_HAGCCFG6_REG	(0x0E)
#define AW_PID_2071_HAGCCFG7_REG	(0x0F)
#define AW_PID_2071_HAGCST_REG		(0x10)
#define AW_PID_2071_PRODID_REG		(0x11)
#define AW_PID_2071_VBAT_REG		(0x12)
#define AW_PID_2071_TEMP_REG		(0x13)
#define AW_PID_2071_PVDD_REG		(0x14)
#define AW_PID_2071_HAGCCFG8_REG	(0x15)
#define AW_PID_2071_DBGCTRL_REG		(0x20)
#define AW_PID_2071_I2SINT_REG		(0x21)
#define AW_PID_2071_I2SCAPCNT_REG	(0x22)
#define AW_PID_2071_ANASTA1_REG		(0x23)
#define AW_PID_2071_ANASTA2_REG		(0x24)
#define AW_PID_2071_ANASTA3_REG		(0x25)
#define AW_PID_2071_ANASTA4_REG		(0x26)
#define AW_PID_2071_DSMCFG8_REG		(0x37)
#define AW_PID_2071_TESTIN_REG		(0x38)
#define AW_PID_2071_TESTOUT_REG		(0x39)
#define AW_PID_2071_SADCCTRL2_REG	(0x3A)
#define AW_PID_2071_SADCCTRL3_REG	(0x3B)
#define AW_PID_2071_SADCCTRL4_REG	(0x3C)
#define AW_PID_2071_VSNCTRL1_REG	(0x50)
#define AW_PID_2071_ISNCTRL1_REG	(0x52)
#define AW_PID_2071_ISNCTRL2_REG	(0x53)
#define AW_PID_2071_VTMCTRL1_REG	(0x54)
#define AW_PID_2071_VTMCTRL2_REG	(0x55)
#define AW_PID_2071_VTMCTRL3_REG	(0x56)
#define AW_PID_2071_ISNDAT_REG		(0x57)
#define AW_PID_2071_VSNDAT_REG		(0x58)
#define AW_PID_2071_PWMCTRL_REG		(0x59)
#define AW_PID_2071_PWMCTRL2_REG	(0x5A)
#define AW_PID_2071_PWMCTRL3_REG	(0x5B)
#define AW_PID_2071_VCALDAT_REG		(0x5C)
#define AW_PID_2071_BSTCTRL1_REG	(0x60)
#define AW_PID_2071_BSTCTRL2_REG	(0x61)
#define AW_PID_2071_BSTCTRL3_REG	(0x62)
#define AW_PID_2071_BSTDBG1_REG		(0x63)
#define AW_PID_2071_BSTDBG2_REG		(0x64)
#define AW_PID_2071_BSTDBG3_REG		(0x65)
#define AW_PID_2071_PLLCTRL1_REG	(0x66)
#define AW_PID_2071_PLLCTRL2_REG	(0x67)
#define AW_PID_2071_PLLCTRL3_REG	(0x68)
#define AW_PID_2071_CDACTRL1_REG	(0x69)
#define AW_PID_2071_CDACTRL2_REG	(0x6A)
#define AW_PID_2071_SADCCTRL_REG	(0x6B)
#define AW_PID_2071_BSTCTRL8_REG	(0x6C)
#define AW_PID_2071_DITHERCFG1_REG	(0x6D)
#define AW_PID_2071_TESTCTRL1_REG	(0x70)
#define AW_PID_2071_TESTCTRL2_REG	(0x71)
#define AW_PID_2071_EFCTRL1_REG		(0x72)
#define AW_PID_2071_EFCTRL2_REG		(0x73)
#define AW_PID_2071_EFWH_REG		(0x74)
#define AW_PID_2071_EFWM2_REG		(0x75)
#define AW_PID_2071_EFWM1_REG		(0x76)
#define AW_PID_2071_EFWL_REG		(0x77)
#define AW_PID_2071_EFRH_REG		(0x78)
#define AW_PID_2071_EFRM2_REG		(0x79)
#define AW_PID_2071_EFRM1_REG		(0x7A)
#define AW_PID_2071_EFRL_REG		(0x7B)
#define AW_PID_2071_TESTDET_REG		(0x7C)
#define AW_PID_2071_TM_REG		(0x7D)

/********************************************
 * Register Access
 *******************************************/
#define AW_PID_2071_REG_MAX	(0x7E)

#define AW_PID_2071_REG_NONE_ACCESS			(0)
#define AW_PID_2071_REG_RD_ACCESS			(1 << 0)
#define AW_PID_2071_REG_WR_ACCESS					(1 << 1)

const unsigned char aw_pid_2071_reg_access[AW_PID_2071_REG_MAX] = {
	[AW_PID_2071_ID_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_SYSST_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_SYSINT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_SYSINTM_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_SYSCTRL_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_SYSCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_I2SCTRL_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_I2SCFG1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_I2SCFG2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG4_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG5_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG6_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCCFG7_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_HAGCST_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_PRODID_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_VBAT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_TEMP_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_PVDD_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_HAGCCFG8_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_DBGCTRL_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_I2SINT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_I2SCAPCNT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_ANASTA1_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_ANASTA2_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_ANASTA3_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_ANASTA4_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_DSMCFG8_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_TESTIN_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_TESTOUT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_SADCCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_SADCCTRL3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_SADCCTRL4_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_VSNCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_ISNCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_ISNCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_VTMCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_VTMCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_VTMCTRL3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_ISNDAT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_VSNDAT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_PWMCTRL_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_PWMCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_PWMCTRL3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_VCALDAT_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_BSTCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_BSTCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_BSTCTRL3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_BSTDBG1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_BSTDBG2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_BSTDBG3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_PLLCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_PLLCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_PLLCTRL3_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_CDACTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_CDACTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_SADCCTRL_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_BSTCTRL8_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_DITHERCFG1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_TESTCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_TESTCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFCTRL1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFCTRL2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFWH_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFWM2_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFWM1_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFWL_REG]	= (AW_PID_2071_REG_RD_ACCESS | AW_PID_2071_REG_WR_ACCESS),
	[AW_PID_2071_EFRH_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_EFRM2_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_EFRM1_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_EFRL_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_TESTDET_REG]	= (AW_PID_2071_REG_RD_ACCESS),
	[AW_PID_2071_TM_REG]	= (AW_PID_2071_REG_NONE_ACCESS),
};

/* detail information of registers begin */
/* ID (0x00) detail */
/* IDCODE bit 15:0 (ID 0x00) */
#define AW_PID_2071_IDCODE_START_BIT	(0)
#define AW_PID_2071_IDCODE_BITS_LEN	(16)
#define AW_PID_2071_IDCODE_MASK	\
	(~(((1<<AW_PID_2071_IDCODE_BITS_LEN)-1) << AW_PID_2071_IDCODE_START_BIT))

#define AW_PID_2071_IDCODE_DEFAULT_VALUE	(0x2071)
#define AW_PID_2071_IDCODE_DEFAULT	\
	(AW_PID_2071_IDCODE_DEFAULT_VALUE << AW_PID_2071_IDCODE_START_BIT)

/* default value of ID (0x00) */
/* #define AW_PID_2071_ID_DEFAULT		(0x2071) */

/* SYSST (0x01) detail */
/* OVP2S bit 15 (SYSST 0x01) */
#define AW_PID_2071_OVP2S_START_BIT	(15)
#define AW_PID_2071_OVP2S_BITS_LEN	(1)
#define AW_PID_2071_OVP2S_MASK	\
	(~(((1<<AW_PID_2071_OVP2S_BITS_LEN)-1) << AW_PID_2071_OVP2S_START_BIT))

#define AW_PID_2071_OVP2S_NORMAL	(0)
#define AW_PID_2071_OVP2S_NORMAL_VALUE	\
	(AW_PID_2071_OVP2S_NORMAL << AW_PID_2071_OVP2S_START_BIT)

#define AW_PID_2071_OVP2S_OVP	(1)
#define AW_PID_2071_OVP2S_OVP_VALUE	\
	(AW_PID_2071_OVP2S_OVP << AW_PID_2071_OVP2S_START_BIT)

#define AW_PID_2071_OVP2S_DEFAULT_VALUE	(0)
#define AW_PID_2071_OVP2S_DEFAULT	\
	(AW_PID_2071_OVP2S_DEFAULT_VALUE << AW_PID_2071_OVP2S_START_BIT)

/* UVLS bit 14 (SYSST 0x01) */
#define AW_PID_2071_UVLS_START_BIT	(14)
#define AW_PID_2071_UVLS_BITS_LEN	(1)
#define AW_PID_2071_UVLS_MASK	\
	(~(((1<<AW_PID_2071_UVLS_BITS_LEN)-1) << AW_PID_2071_UVLS_START_BIT))

#define AW_PID_2071_UVLS_VDD_ABOVE_2P8V	(0)
#define AW_PID_2071_UVLS_VDD_ABOVE_2P8V_VALUE	\
	(AW_PID_2071_UVLS_VDD_ABOVE_2P8V << AW_PID_2071_UVLS_START_BIT)

