LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
/* BOPI bit 2 (SYSINT 0x02) */
#define AW_PID_2071_BOPI_START_BIT	(2)
#define AW_PID_2071_BOPI_BITS_LEN	(1)
#define AW_PID_2071_BOPI_MASK	\
	(~(((1<<AW_PID_2071_BOPI_BITS_LEN)-1) << AW_PID_2071_BOPI_START_BIT))

#define AW_PID_2071_BOPI_DEFAULT_VALUE	(0)
#define AW_PID_2071_BOPI_DEFAULT	\
	(AW_PID_2071_BOPI_DEFAULT_VALUE << AW_PID_2071_BOPI_START_BIT)

/* OTHI bit 1 (SYSINT 0x02) */
#define AW_PID_2071_OTHI_START_BIT	(1)
#define AW_PID_2071_OTHI_BITS_LEN	(1)
#define AW_PID_2071_OTHI_MASK	\
	(~(((1<<AW_PID_2071_OTHI_BITS_LEN)-1) << AW_PID_2071_OTHI_START_BIT))

#define AW_PID_2071_OTHI_DEFAULT_VALUE	(0)
#define AW_PID_2071_OTHI_DEFAULT	\
	(AW_PID_2071_OTHI_DEFAULT_VALUE << AW_PID_2071_OTHI_START_BIT)

/* PLLI bit 0 (SYSINT 0x02) */
#define AW_PID_2071_PLLI_START_BIT	(0)
#define AW_PID_2071_PLLI_BITS_LEN	(1)
#define AW_PID_2071_PLLI_MASK	\
	(~(((1<<AW_PID_2071_PLLI_BITS_LEN)-1) << AW_PID_2071_PLLI_START_BIT))

#define AW_PID_2071_PLLI_DEFAULT_VALUE	(0)
#define AW_PID_2071_PLLI_DEFAULT	\
	(AW_PID_2071_PLLI_DEFAULT_VALUE << AW_PID_2071_PLLI_START_BIT)

/* default value of SYSINT (0x02) */
/* #define AW_PID_2071_SYSINT_DEFAULT		(0x0000) */

/* SYSINTM (0x03) detail */
/* OVP2M bit 15 (SYSINTM 0x03) */
#define AW_PID_2071_OVP2M_START_BIT	(15)
#define AW_PID_2071_OVP2M_BITS_LEN	(1)
#define AW_PID_2071_OVP2M_MASK	\
	(~(((1<<AW_PID_2071_OVP2M_BITS_LEN)-1) << AW_PID_2071_OVP2M_START_BIT))

#define AW_PID_2071_OVP2M_DEFAULT_VALUE	(1)
#define AW_PID_2071_OVP2M_DEFAULT	\
	(AW_PID_2071_OVP2M_DEFAULT_VALUE << AW_PID_2071_OVP2M_START_BIT)

/* UVLM bit 14 (SYSINTM 0x03) */
#define AW_PID_2071_UVLM_START_BIT	(14)
#define AW_PID_2071_UVLM_BITS_LEN	(1)
#define AW_PID_2071_UVLM_MASK	\
	(~(((1<<AW_PID_2071_UVLM_BITS_LEN)-1) << AW_PID_2071_UVLM_START_BIT))

#define AW_PID_2071_UVLM_DEFAULT_VALUE	(1)
#define AW_PID_2071_UVLM_DEFAULT	\
	(AW_PID_2071_UVLM_DEFAULT_VALUE << AW_PID_2071_UVLM_START_BIT)

/* ADPM bit 13 (SYSINTM 0x03) */
#define AW_PID_2071_ADPM_START_BIT	(13)
#define AW_PID_2071_ADPM_BITS_LEN	(1)
#define AW_PID_2071_ADPM_MASK	\
	(~(((1<<AW_PID_2071_ADPM_BITS_LEN)-1) << AW_PID_2071_ADPM_START_BIT))

#define AW_PID_2071_ADPM_DEFAULT_VALUE	(1)
#define AW_PID_2071_ADPM_DEFAULT	\
	(AW_PID_2071_ADPM_DEFAULT_VALUE << AW_PID_2071_ADPM_START_BIT)

/* BSTOCM bit 11 (SYSINTM 0x03) */
#define AW_PID_2071_BSTOCM_START_BIT	(11)
#define AW_PID_2071_BSTOCM_BITS_LEN	(1)
#define AW_PID_2071_BSTOCM_MASK	\
	(~(((1<<AW_PID_2071_BSTOCM_BITS_LEN)-1) << AW_PID_2071_BSTOCM_START_BIT))

#define AW_PID_2071_BSTOCM_DEFAULT_VALUE	(1)
#define AW_PID_2071_BSTOCM_DEFAULT	\
	(AW_PID_2071_BSTOCM_DEFAULT_VALUE << AW_PID_2071_BSTOCM_START_BIT)

/* OVPM bit 10 (SYSINTM 0x03) */
#define AW_PID_2071_OVPM_START_BIT	(10)
#define AW_PID_2071_OVPM_BITS_LEN	(1)
#define AW_PID_2071_OVPM_MASK	\
	(~(((1<<AW_PID_2071_OVPM_BITS_LEN)-1) << AW_PID_2071_OVPM_START_BIT))

#define AW_PID_2071_OVPM_DEFAULT_VALUE	(1)
#define AW_PID_2071_OVPM_DEFAULT	\
	(AW_PID_2071_OVPM_DEFAULT_VALUE << AW_PID_2071_OVPM_START_BIT)

/* BSTM bit 9 (SYSINTM 0x03) */
#define AW_PID_2071_BSTM_START_BIT	(9)
#define AW_PID_2071_BSTM_BITS_LEN	(1)
#define AW_PID_2071_BSTM_MASK	\
	(~(((1<<AW_PID_2071_BSTM_BITS_LEN)-1) << AW_PID_2071_BSTM_START_BIT))

#define AW_PID_2071_BSTM_DEFAULT_VALUE	(1)
#define AW_PID_2071_BSTM_DEFAULT	\
	(AW_PID_2071_BSTM_DEFAULT_VALUE << AW_PID_2071_BSTM_START_BIT)

/* SWM bit 8 (SYSINTM 0x03) */
#define AW_PID_2071_SWM_START_BIT	(8)
#define AW_PID_2071_SWM_BITS_LEN	(1)
#define AW_PID_2071_SWM_MASK	\
	(~(((1<<AW_PID_2071_SWM_BITS_LEN)-1) << AW_PID_2071_SWM_START_BIT))

#define AW_PID_2071_SWM_DEFAULT_VALUE	(1)
#define AW_PID_2071_SWM_DEFAULT	\
	(AW_PID_2071_SWM_DEFAULT_VALUE << AW_PID_2071_SWM_START_BIT)

/* CLIPM bit 7 (SYSINTM 0x03) */
#define AW_PID_2071_CLIPM_START_BIT	(7)
#define AW_PID_2071_CLIPM_BITS_LEN	(1)
#define AW_PID_2071_CLIPM_MASK	\
	(~(((1<<AW_PID_2071_CLIPM_BITS_LEN)-1) << AW_PID_2071_CLIPM_START_BIT))

#define AW_PID_2071_CLIPM_DEFAULT_VALUE	(1)
#define AW_PID_2071_CLIPM_DEFAULT	\
	(AW_PID_2071_CLIPM_DEFAULT_VALUE << AW_PID_2071_CLIPM_START_BIT)

/* NOCLKM bit 5 (SYSINTM 0x03) */
#define AW_PID_2071_NOCLKM_START_BIT	(5)
#define AW_PID_2071_NOCLKM_BITS_LEN	(1)
#define AW_PID_2071_NOCLKM_MASK	\
	(~(((1<<AW_PID_2071_NOCLKM_BITS_LEN)-1) << AW_PID_2071_NOCLKM_START_BIT))

#define AW_PID_2071_NOCLKM_DEFAULT_VALUE	(1)
#define AW_PID_2071_NOCLKM_DEFAULT	\
	(AW_PID_2071_NOCLKM_DEFAULT_VALUE << AW_PID_2071_NOCLKM_START_BIT)

/* CLKM bit 4 (SYSINTM 0x03) */
#define AW_PID_2071_CLKM_START_BIT	(4)
#define AW_PID_2071_CLKM_BITS_LEN	(1)
#define AW_PID_2071_CLKM_MASK	\
	(~(((1<<AW_PID_2071_CLKM_BITS_LEN)-1) << AW_PID_2071_CLKM_START_BIT))

#define AW_PID_2071_CLKM_DEFAULT_VALUE	(1)
#define AW_PID_2071_CLKM_DEFAULT	\
	(AW_PID_2071_CLKM_DEFAULT_VALUE << AW_PID_2071_CLKM_START_BIT)

/* OCDM bit 3 (SYSINTM 0x03) */
#define AW_PID_2071_OCDM_START_BIT	(3)
#define AW_PID_2071_OCDM_BITS_LEN	(1)
#define AW_PID_2071_OCDM_MASK	\
	(~(((1<<AW_PID_2071_OCDM_BITS_LEN)-1) << AW_PID_2071_OCDM_START_BIT))

#define AW_PID_2071_OCDM_DEFAULT_VALUE	(1)
#define AW_PID_2071_OCDM_DEFAULT	\
	(AW_PID_2071_OCDM_DEFAULT_VALUE << AW_PID_2071_OCDM_START_BIT)

/* BOPM bit 2 (SYSINTM 0x03) */
#define AW_PID_2071_BOPM_START_BIT	(2)
#define AW_PID_2071_BOPM_BITS_LEN	(1)
#define AW_PID_2071_BOPM_MASK	\
	(~(((1<<AW_PID_2071_BOPM_BITS_LEN)-1) << AW_PID_2071_BOPM_START_BIT))

#define AW_PID_2071_BOPM_DEFAULT_VALUE	(1)
#define AW_PID_2071_BOPM_DEFAULT	\
	(AW_PID_2071_BOPM_DEFAULT_VALUE << AW_PID_2071_BOPM_START_BIT)

/* OTHM bit 1 (SYSINTM 0x03) */
#define AW_PID_2071_OTHM_START_BIT	(1)
#define AW_PID_2071_OTHM_BITS_LEN	(1)
#define AW_PID_2071_OTHM_MASK	\
	(~(((1<<AW_PID_2071_OTHM_BITS_LEN)-1) << AW_PID_2071_OTHM_START_BIT))

#define AW_PID_2071_OTHM_DEFAULT_VALUE	(1)
#define AW_PID_2071_OTHM_DEFAULT	\
	(AW_PID_2071_OTHM_DEFAULT_VALUE << AW_PID_2071_OTHM_START_BIT)

/* PLLM bit 0 (SYSINTM 0x03) */
#define AW_PID_2071_PLLM_START_BIT	(0)
#define AW_PID_2071_PLLM_BITS_LEN	(1)
#define AW_PID_2071_PLLM_MASK	\
	(~(((1<<AW_PID_2071_PLLM_BITS_LEN)-1) << AW_PID_2071_PLLM_START_BIT))

#define AW_PID_2071_PLLM_DEFAULT_VALUE	(1)
#define AW_PID_2071_PLLM_DEFAULT	\
	(AW_PID_2071_PLLM_DEFAULT_VALUE << AW_PID_2071_PLLM_START_BIT)

/* default value of SYSINTM (0x03) */
#define AW_PID_2071_SYSINTM_DEFAULT		(0xEFBF)

