LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
/* SYSCTRL (0x04) detail */
/* ULS_MODE bit 15 (SYSCTRL 0x04) */
#define AW_PID_2071_ULS_MODE_START_BIT	(15)
#define AW_PID_2071_ULS_MODE_BITS_LEN	(1)
#define AW_PID_2071_ULS_MODE_MASK	\
	(~(((1<<AW_PID_2071_ULS_MODE_BITS_LEN)-1) << AW_PID_2071_ULS_MODE_START_BIT))

#define AW_PID_2071_ULS_MODE_LEGACY	(0)
#define AW_PID_2071_ULS_MODE_LEGACY_VALUE	\
	(AW_PID_2071_ULS_MODE_LEGACY << AW_PID_2071_ULS_MODE_START_BIT)

#define AW_PID_2071_ULS_MODE_TDM	(1)
#define AW_PID_2071_ULS_MODE_TDM_VALUE	\
	(AW_PID_2071_ULS_MODE_TDM << AW_PID_2071_ULS_MODE_START_BIT)

#define AW_PID_2071_ULS_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2071_ULS_MODE_DEFAULT	\
	(AW_PID_2071_ULS_MODE_DEFAULT_VALUE << AW_PID_2071_ULS_MODE_START_BIT)

/* SPK_GAIN bit 14:12 (SYSCTRL 0x04) */
#define AW_PID_2071_SPK_GAIN_START_BIT	(12)
#define AW_PID_2071_SPK_GAIN_BITS_LEN	(3)
#define AW_PID_2071_SPK_GAIN_MASK	\
	(~(((1<<AW_PID_2071_SPK_GAIN_BITS_LEN)-1) << AW_PID_2071_SPK_GAIN_START_BIT))

#define AW_PID_2071_SPK_GAIN_6	(0)
#define AW_PID_2071_SPK_GAIN_6_VALUE	\
	(AW_PID_2071_SPK_GAIN_6 << AW_PID_2071_SPK_GAIN_START_BIT)

#define AW_PID_2071_SPK_GAIN_7	(1)
#define AW_PID_2071_SPK_GAIN_7_VALUE	\
	(AW_PID_2071_SPK_GAIN_7 << AW_PID_2071_SPK_GAIN_START_BIT)

#define AW_PID_2071_SPK_GAIN_10P6	(2)
#define AW_PID_2071_SPK_GAIN_10P6_VALUE	\
	(AW_PID_2071_SPK_GAIN_10P6 << AW_PID_2071_SPK_GAIN_START_BIT)

#define AW_PID_2071_SPK_GAIN_12	(3)
#define AW_PID_2071_SPK_GAIN_12_VALUE	\
	(AW_PID_2071_SPK_GAIN_12 << AW_PID_2071_SPK_GAIN_START_BIT)

#define AW_PID_2071_SPK_GAIN_14	(4)
#define AW_PID_2071_SPK_GAIN_14_VALUE	\
	(AW_PID_2071_SPK_GAIN_14 << AW_PID_2071_SPK_GAIN_START_BIT)

#define AW_PID_2071_SPK_GAIN_DEFAULT_VALUE	(0x4)
#define AW_PID_2071_SPK_GAIN_DEFAULT	\
	(AW_PID_2071_SPK_GAIN_DEFAULT_VALUE << AW_PID_2071_SPK_GAIN_START_BIT)

/* RCV_GAIN bit 10 (SYSCTRL 0x04) */
#define AW_PID_2071_RCV_GAIN_START_BIT	(10)
#define AW_PID_2071_RCV_GAIN_BITS_LEN	(1)
#define AW_PID_2071_RCV_GAIN_MASK	\
	(~(((1<<AW_PID_2071_RCV_GAIN_BITS_LEN)-1) << AW_PID_2071_RCV_GAIN_START_BIT))

#define AW_PID_2071_RCV_GAIN_4P5	(0)
#define AW_PID_2071_RCV_GAIN_4P5_VALUE	\
	(AW_PID_2071_RCV_GAIN_4P5 << AW_PID_2071_RCV_GAIN_START_BIT)

#define AW_PID_2071_RCV_GAIN_5P0	(1)
#define AW_PID_2071_RCV_GAIN_5P0_VALUE	\
	(AW_PID_2071_RCV_GAIN_5P0 << AW_PID_2071_RCV_GAIN_START_BIT)

#define AW_PID_2071_RCV_GAIN_DEFAULT_VALUE	(0)
#define AW_PID_2071_RCV_GAIN_DEFAULT	\
	(AW_PID_2071_RCV_GAIN_DEFAULT_VALUE << AW_PID_2071_RCV_GAIN_START_BIT)

/* INTMODE bit 9 (SYSCTRL 0x04) */
#define AW_PID_2071_INTMODE_START_BIT	(9)
#define AW_PID_2071_INTMODE_BITS_LEN	(1)
#define AW_PID_2071_INTMODE_MASK	\
	(~(((1<<AW_PID_2071_INTMODE_BITS_LEN)-1) << AW_PID_2071_INTMODE_START_BIT))

#define AW_PID_2071_INTMODE_OPENMINUS_DRAIN	(0)
#define AW_PID_2071_INTMODE_OPENMINUS_DRAIN_VALUE	\
	(AW_PID_2071_INTMODE_OPENMINUS_DRAIN << AW_PID_2071_INTMODE_START_BIT)

#define AW_PID_2071_INTMODE_PUSHPULL	(1)
#define AW_PID_2071_INTMODE_PUSHPULL_VALUE	\
	(AW_PID_2071_INTMODE_PUSHPULL << AW_PID_2071_INTMODE_START_BIT)

#define AW_PID_2071_INTMODE_DEFAULT_VALUE	(0)
#define AW_PID_2071_INTMODE_DEFAULT	\
	(AW_PID_2071_INTMODE_DEFAULT_VALUE << AW_PID_2071_INTMODE_START_BIT)

/* INTN bit 8 (SYSCTRL 0x04) */
#define AW_PID_2071_INTN_START_BIT	(8)
#define AW_PID_2071_INTN_BITS_LEN	(1)
#define AW_PID_2071_INTN_MASK	\
	(~(((1<<AW_PID_2071_INTN_BITS_LEN)-1) << AW_PID_2071_INTN_START_BIT))

#define AW_PID_2071_INTN_SYSINT	(0)
#define AW_PID_2071_INTN_SYSINT_VALUE	\
	(AW_PID_2071_INTN_SYSINT << AW_PID_2071_INTN_START_BIT)

#define AW_PID_2071_INTN_SYSST	(1)
#define AW_PID_2071_INTN_SYSST_VALUE	\
	(AW_PID_2071_INTN_SYSST << AW_PID_2071_INTN_START_BIT)

#define AW_PID_2071_INTN_DEFAULT_VALUE	(0)
#define AW_PID_2071_INTN_DEFAULT	\
	(AW_PID_2071_INTN_DEFAULT_VALUE << AW_PID_2071_INTN_START_BIT)

/* RCV_MODE bit 7 (SYSCTRL 0x04) */
#define AW_PID_2071_RCV_MODE_START_BIT	(7)
#define AW_PID_2071_RCV_MODE_BITS_LEN	(1)
#define AW_PID_2071_RCV_MODE_MASK	\
	(~(((1<<AW_PID_2071_RCV_MODE_BITS_LEN)-1) << AW_PID_2071_RCV_MODE_START_BIT))

#define AW_PID_2071_RCV_MODE_SPEAKER	(0)
#define AW_PID_2071_RCV_MODE_SPEAKER_VALUE	\
	(AW_PID_2071_RCV_MODE_SPEAKER << AW_PID_2071_RCV_MODE_START_BIT)

#define AW_PID_2071_RCV_MODE_RECEIVER	(1)
#define AW_PID_2071_RCV_MODE_RECEIVER_VALUE	\
	(AW_PID_2071_RCV_MODE_RECEIVER << AW_PID_2071_RCV_MODE_START_BIT)

#define AW_PID_2071_RCV_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2071_RCV_MODE_DEFAULT	\
	(AW_PID_2071_RCV_MODE_DEFAULT_VALUE << AW_PID_2071_RCV_MODE_START_BIT)

/* I2SEN bit 6 (SYSCTRL 0x04) */
#define AW_PID_2071_I2SEN_START_BIT	(6)
#define AW_PID_2071_I2SEN_BITS_LEN	(1)
#define AW_PID_2071_I2SEN_MASK	\
	(~(((1<<AW_PID_2071_I2SEN_BITS_LEN)-1) << AW_PID_2071_I2SEN_START_BIT))

#define AW_PID_2071_I2SEN_DISABLE	(0)
#define AW_PID_2071_I2SEN_DISABLE_VALUE	\
	(AW_PID_2071_I2SEN_DISABLE << AW_PID_2071_I2SEN_START_BIT)

#define AW_PID_2071_I2SEN_ENABLE	(1)
#define AW_PID_2071_I2SEN_ENABLE_VALUE	\
	(AW_PID_2071_I2SEN_ENABLE << AW_PID_2071_I2SEN_START_BIT)

#define AW_PID_2071_I2SEN_DEFAULT_VALUE	(0)
#define AW_PID_2071_I2SEN_DEFAULT	\
	(AW_PID_2071_I2SEN_DEFAULT_VALUE << AW_PID_2071_I2SEN_START_BIT)

/* WSINV bit 5 (SYSCTRL 0x04) */
#define AW_PID_2071_WSINV_START_BIT	(5)
#define AW_PID_2071_WSINV_BITS_LEN	(1)
#define AW_PID_2071_WSINV_MASK	\
	(~(((1<<AW_PID_2071_WSINV_BITS_LEN)-1) << AW_PID_2071_WSINV_START_BIT))

#define AW_PID_2071_WSINV_NOT_SWITCH	(0)
#define AW_PID_2071_WSINV_NOT_SWITCH_VALUE	\
	(AW_PID_2071_WSINV_NOT_SWITCH << AW_PID_2071_WSINV_START_BIT)

#define AW_PID_2071_WSINV_SWITCH	(1)
#define AW_PID_2071_WSINV_SWITCH_VALUE	\
	(AW_PID_2071_WSINV_SWITCH << AW_PID_2071_WSINV_START_BIT)

#define AW_PID_2071_WSINV_DEFAULT_VALUE	(0)
#define AW_PID_2071_WSINV_DEFAULT	\
	(AW_PID_2071_WSINV_DEFAULT_VALUE << AW_PID_2071_WSINV_START_BIT)

/* BCKINV bit 4 (SYSCTRL 0x04) */
#define AW_PID_2071_BCKINV_START_BIT	(4)
#define AW_PID_2071_BCKINV_BITS_LEN	(1)
#define AW_PID_2071_BCKINV_MASK	\
	(~(((1<<AW_PID_2071_BCKINV_BITS_LEN)-1) << AW_PID_2071_BCKINV_START_BIT))

#define AW_PID_2071_BCKINV_NOT_INVERT	(0)
#define AW_PID_2071_BCKINV_NOT_INVERT_VALUE	\
	(AW_PID_2071_BCKINV_NOT_INVERT << AW_PID_2071_BCKINV_START_BIT)

#define AW_PID_2071_BCKINV_INVERTED	(1)
#define AW_PID_2071_BCKINV_INVERTED_VALUE	\
	(AW_PID_2071_BCKINV_INVERTED << AW_PID_2071_BCKINV_START_BIT)

#define AW_PID_2071_BCKINV_DEFAULT_VALUE	(0)
#define AW_PID_2071_BCKINV_DEFAULT	\
	(AW_PID_2071_BCKINV_DEFAULT_VALUE << AW_PID_2071_BCKINV_START_BIT)

