LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
/* IPLL bit 3 (SYSCTRL 0x04) */
#define AW_PID_2071_IPLL_START_BIT	(3)
#define AW_PID_2071_IPLL_BITS_LEN	(1)
#define AW_PID_2071_IPLL_MASK	\
	(~(((1<<AW_PID_2071_IPLL_BITS_LEN)-1) << AW_PID_2071_IPLL_START_BIT))

#define AW_PID_2071_IPLL_BCK	(0)
#define AW_PID_2071_IPLL_BCK_VALUE	\
	(AW_PID_2071_IPLL_BCK << AW_PID_2071_IPLL_START_BIT)

#define AW_PID_2071_IPLL_WCK	(1)
#define AW_PID_2071_IPLL_WCK_VALUE	\
	(AW_PID_2071_IPLL_WCK << AW_PID_2071_IPLL_START_BIT)

#define AW_PID_2071_IPLL_DEFAULT_VALUE	(0)
#define AW_PID_2071_IPLL_DEFAULT	\
	(AW_PID_2071_IPLL_DEFAULT_VALUE << AW_PID_2071_IPLL_START_BIT)

/* AMPPD bit 1 (SYSCTRL 0x04) */
#define AW_PID_2071_AMPPD_START_BIT	(1)
#define AW_PID_2071_AMPPD_BITS_LEN	(1)
#define AW_PID_2071_AMPPD_MASK	\
	(~(((1<<AW_PID_2071_AMPPD_BITS_LEN)-1) << AW_PID_2071_AMPPD_START_BIT))

#define AW_PID_2071_AMPPD_WORKING	(0)
#define AW_PID_2071_AMPPD_WORKING_VALUE	\
	(AW_PID_2071_AMPPD_WORKING << AW_PID_2071_AMPPD_START_BIT)

#define AW_PID_2071_AMPPD_POWER_DOWN	(1)
#define AW_PID_2071_AMPPD_POWER_DOWN_VALUE	\
	(AW_PID_2071_AMPPD_POWER_DOWN << AW_PID_2071_AMPPD_START_BIT)

#define AW_PID_2071_AMPPD_DEFAULT_VALUE	(1)
#define AW_PID_2071_AMPPD_DEFAULT	\
	(AW_PID_2071_AMPPD_DEFAULT_VALUE << AW_PID_2071_AMPPD_START_BIT)

/* PWDN bit 0 (SYSCTRL 0x04) */
#define AW_PID_2071_PWDN_START_BIT	(0)
#define AW_PID_2071_PWDN_BITS_LEN	(1)
#define AW_PID_2071_PWDN_MASK	\
	(~(((1<<AW_PID_2071_PWDN_BITS_LEN)-1) << AW_PID_2071_PWDN_START_BIT))

#define AW_PID_2071_PWDN_WORKING	(0)
#define AW_PID_2071_PWDN_WORKING_VALUE	\
	(AW_PID_2071_PWDN_WORKING << AW_PID_2071_PWDN_START_BIT)

#define AW_PID_2071_PWDN_POWER_DOWN	(1)
#define AW_PID_2071_PWDN_POWER_DOWN_VALUE	\
	(AW_PID_2071_PWDN_POWER_DOWN << AW_PID_2071_PWDN_START_BIT)

#define AW_PID_2071_PWDN_DEFAULT_VALUE	(1)
#define AW_PID_2071_PWDN_DEFAULT	\
	(AW_PID_2071_PWDN_DEFAULT_VALUE << AW_PID_2071_PWDN_START_BIT)

/* default value of SYSCTRL (0x04) */
/* #define AW_PID_2071_SYSCTRL_DEFAULT		(0x4003) */

/* SYSCTRL2 (0x05) detail */
/* VOL bit 15:6 (SYSCTRL2 0x05) */
#define AW_PID_2071_VOL_START_BIT	(6)
#define AW_PID_2071_VOL_BITS_LEN	(10)
#define AW_PID_2071_VOL_MASK	\
	(~(((1<<AW_PID_2071_VOL_BITS_LEN)-1) << AW_PID_2071_VOL_START_BIT))

#define AW_PID_2071_MUTE_VOL	(90 * 8)
#define AW_PID_2071_VOL_STEP_DB	(6 * 8)

#define AW_PID_2071_VOL_DEFAULT_VALUE	(0)
#define AW_PID_2071_VOL_DEFAULT	\
	(AW_PID_2071_VOL_DEFAULT_VALUE << AW_PID_2071_VOL_START_BIT)

/* HDCCE bit 5 (SYSCTRL2 0x05) */
#define AW_PID_2071_HDCCE_START_BIT	(5)
#define AW_PID_2071_HDCCE_BITS_LEN	(1)
#define AW_PID_2071_HDCCE_MASK	\
	(~(((1<<AW_PID_2071_HDCCE_BITS_LEN)-1) << AW_PID_2071_HDCCE_START_BIT))

#define AW_PID_2071_HDCCE_DISABLE	(0)
#define AW_PID_2071_HDCCE_DISABLE_VALUE	\
	(AW_PID_2071_HDCCE_DISABLE << AW_PID_2071_HDCCE_START_BIT)

#define AW_PID_2071_HDCCE_ENABLE	(1)
#define AW_PID_2071_HDCCE_ENABLE_VALUE	\
	(AW_PID_2071_HDCCE_ENABLE << AW_PID_2071_HDCCE_START_BIT)

#define AW_PID_2071_HDCCE_DEFAULT_VALUE	(1)
#define AW_PID_2071_HDCCE_DEFAULT	\
	(AW_PID_2071_HDCCE_DEFAULT_VALUE << AW_PID_2071_HDCCE_START_BIT)

/* HMUTE bit 4 (SYSCTRL2 0x05) */
#define AW_PID_2071_HMUTE_START_BIT	(4)
#define AW_PID_2071_HMUTE_BITS_LEN	(1)
#define AW_PID_2071_HMUTE_MASK	\
	(~(((1<<AW_PID_2071_HMUTE_BITS_LEN)-1) << AW_PID_2071_HMUTE_START_BIT))

#define AW_PID_2071_HMUTE_DISABLE	(0)
#define AW_PID_2071_HMUTE_DISABLE_VALUE	\
	(AW_PID_2071_HMUTE_DISABLE << AW_PID_2071_HMUTE_START_BIT)

#define AW_PID_2071_HMUTE_ENABLE	(1)
#define AW_PID_2071_HMUTE_ENABLE_VALUE	\
	(AW_PID_2071_HMUTE_ENABLE << AW_PID_2071_HMUTE_START_BIT)

#define AW_PID_2071_HMUTE_DEFAULT_VALUE	(1)
#define AW_PID_2071_HMUTE_DEFAULT	\
	(AW_PID_2071_HMUTE_DEFAULT_VALUE << AW_PID_2071_HMUTE_START_BIT)

/* BST_IPEAK bit 3:0 (SYSCTRL2 0x05) */
#define AW_PID_2071_BST_IPEAK_START_BIT	(0)
#define AW_PID_2071_BST_IPEAK_BITS_LEN	(4)
#define AW_PID_2071_BST_IPEAK_MASK	\
	(~(((1<<AW_PID_2071_BST_IPEAK_BITS_LEN)-1) << AW_PID_2071_BST_IPEAK_START_BIT))

#define AW_PID_2071_BST_IPEAK_1P50A	(0)
#define AW_PID_2071_BST_IPEAK_1P50A_VALUE	\
	(AW_PID_2071_BST_IPEAK_1P50A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_1P75A	(1)
#define AW_PID_2071_BST_IPEAK_1P75A_VALUE	\
	(AW_PID_2071_BST_IPEAK_1P75A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_2P00A	(2)
#define AW_PID_2071_BST_IPEAK_2P00A_VALUE	\
	(AW_PID_2071_BST_IPEAK_2P00A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_2P25A	(3)
#define AW_PID_2071_BST_IPEAK_2P25A_VALUE	\
	(AW_PID_2071_BST_IPEAK_2P25A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_2P50A	(4)
#define AW_PID_2071_BST_IPEAK_2P50A_VALUE	\
	(AW_PID_2071_BST_IPEAK_2P50A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_2P75A	(5)
#define AW_PID_2071_BST_IPEAK_2P75A_VALUE	\
	(AW_PID_2071_BST_IPEAK_2P75A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_3P00A	(6)
#define AW_PID_2071_BST_IPEAK_3P00A_VALUE	\
	(AW_PID_2071_BST_IPEAK_3P00A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_3P25A	(7)
#define AW_PID_2071_BST_IPEAK_3P25A_VALUE	\
	(AW_PID_2071_BST_IPEAK_3P25A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_3P50A	(8)
#define AW_PID_2071_BST_IPEAK_3P50A_VALUE	\
	(AW_PID_2071_BST_IPEAK_3P50A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_3P75A	(9)
#define AW_PID_2071_BST_IPEAK_3P75A_VALUE	\
	(AW_PID_2071_BST_IPEAK_3P75A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_4P00A	(10)
#define AW_PID_2071_BST_IPEAK_4P00A_VALUE	\
	(AW_PID_2071_BST_IPEAK_4P00A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_4P25A	(11)
#define AW_PID_2071_BST_IPEAK_4P25A_VALUE	\
	(AW_PID_2071_BST_IPEAK_4P25A << AW_PID_2071_BST_IPEAK_START_BIT)

#define AW_PID_2071_BST_IPEAK_DEFAULT_VALUE	(8)
#define AW_PID_2071_BST_IPEAK_DEFAULT	\
	(AW_PID_2071_BST_IPEAK_DEFAULT_VALUE << AW_PID_2071_BST_IPEAK_START_BIT)

/* default value of SYSCTRL2 (0x05) */
/* #define AW_PID_2071_SYSCTRL2_DEFAULT		(0x0038) */

