LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
/* I2SCTRL (0x06) detail */
/* RX_THRS bit 15:14 (I2SCTRL 0x06) */
#define AW_PID_2071_RX_THRS_START_BIT	(14)
#define AW_PID_2071_RX_THRS_BITS_LEN	(2)
#define AW_PID_2071_RX_THRS_MASK	\
	(~(((1<<AW_PID_2071_RX_THRS_BITS_LEN)-1) << AW_PID_2071_RX_THRS_START_BIT))

#define AW_PID_2071_RX_THRS_DEFAULT_VALUE	(2)
#define AW_PID_2071_RX_THRS_DEFAULT	\
	(AW_PID_2071_RX_THRS_DEFAULT_VALUE << AW_PID_2071_RX_THRS_START_BIT)

/* INPLEV bit 13 (I2SCTRL 0x06) */
#define AW_PID_2071_INPLEV_START_BIT	(13)
#define AW_PID_2071_INPLEV_BITS_LEN	(1)
#define AW_PID_2071_INPLEV_MASK	\
	(~(((1<<AW_PID_2071_INPLEV_BITS_LEN)-1) << AW_PID_2071_INPLEV_START_BIT))

#define AW_PID_2071_INPLEV_NOT_ATTENUATED	(0)
#define AW_PID_2071_INPLEV_NOT_ATTENUATED_VALUE	\
	(AW_PID_2071_INPLEV_NOT_ATTENUATED << AW_PID_2071_INPLEV_START_BIT)

#define AW_PID_2071_INPLEV_ATTENUATED	(1)
#define AW_PID_2071_INPLEV_ATTENUATED_VALUE	\
	(AW_PID_2071_INPLEV_ATTENUATED << AW_PID_2071_INPLEV_START_BIT)

#define AW_PID_2071_INPLEV_DEFAULT_VALUE	(0)
#define AW_PID_2071_INPLEV_DEFAULT	\
	(AW_PID_2071_INPLEV_DEFAULT_VALUE << AW_PID_2071_INPLEV_START_BIT)

/* I2SRXEN bit 12 (I2SCTRL 0x06) */
#define AW_PID_2071_I2SRXEN_START_BIT	(12)
#define AW_PID_2071_I2SRXEN_BITS_LEN	(1)
#define AW_PID_2071_I2SRXEN_MASK	\
	(~(((1<<AW_PID_2071_I2SRXEN_BITS_LEN)-1) << AW_PID_2071_I2SRXEN_START_BIT))

#define AW_PID_2071_I2SRXEN_DISABLE	(0)
#define AW_PID_2071_I2SRXEN_DISABLE_VALUE	\
	(AW_PID_2071_I2SRXEN_DISABLE << AW_PID_2071_I2SRXEN_START_BIT)

#define AW_PID_2071_I2SRXEN_ENABLE	(1)
#define AW_PID_2071_I2SRXEN_ENABLE_VALUE	\
	(AW_PID_2071_I2SRXEN_ENABLE << AW_PID_2071_I2SRXEN_START_BIT)

#define AW_PID_2071_I2SRXEN_DEFAULT_VALUE	(1)
#define AW_PID_2071_I2SRXEN_DEFAULT	\
	(AW_PID_2071_I2SRXEN_DEFAULT_VALUE << AW_PID_2071_I2SRXEN_START_BIT)

/* CHSEL bit 11:10 (I2SCTRL 0x06) */
#define AW_PID_2071_CHSEL_START_BIT	(10)
#define AW_PID_2071_CHSEL_BITS_LEN	(2)
#define AW_PID_2071_CHSEL_MASK	\
	(~(((1<<AW_PID_2071_CHSEL_BITS_LEN)-1) << AW_PID_2071_CHSEL_START_BIT))

#define AW_PID_2071_CHSEL_RESERVED	(0)
#define AW_PID_2071_CHSEL_RESERVED_VALUE	\
	(AW_PID_2071_CHSEL_RESERVED << AW_PID_2071_CHSEL_START_BIT)

#define AW_PID_2071_CHSEL_LEFT	(1)
#define AW_PID_2071_CHSEL_LEFT_VALUE	\
	(AW_PID_2071_CHSEL_LEFT << AW_PID_2071_CHSEL_START_BIT)

#define AW_PID_2071_CHSEL_RIGHT	(2)
#define AW_PID_2071_CHSEL_RIGHT_VALUE	\
	(AW_PID_2071_CHSEL_RIGHT << AW_PID_2071_CHSEL_START_BIT)

#define AW_PID_2071_CHSEL_MONO	(3)
#define AW_PID_2071_CHSEL_MONO_VALUE	\
	(AW_PID_2071_CHSEL_MONO << AW_PID_2071_CHSEL_START_BIT)

#define AW_PID_2071_CHSEL_DEFAULT_VALUE	(1)
#define AW_PID_2071_CHSEL_DEFAULT	\
	(AW_PID_2071_CHSEL_DEFAULT_VALUE << AW_PID_2071_CHSEL_START_BIT)

/* I2SMD bit 9:8 (I2SCTRL 0x06) */
#define AW_PID_2071_I2SMD_START_BIT	(8)
#define AW_PID_2071_I2SMD_BITS_LEN	(2)
#define AW_PID_2071_I2SMD_MASK	\
	(~(((1<<AW_PID_2071_I2SMD_BITS_LEN)-1) << AW_PID_2071_I2SMD_START_BIT))

#define AW_PID_2071_I2SMD_PHILIP_STANDARD	(0)
#define AW_PID_2071_I2SMD_PHILIP_STANDARD_VALUE	\
	(AW_PID_2071_I2SMD_PHILIP_STANDARD << AW_PID_2071_I2SMD_START_BIT)

#define AW_PID_2071_I2SMD_MSB_JUSTIFIED	(1)
#define AW_PID_2071_I2SMD_MSB_JUSTIFIED_VALUE	\
	(AW_PID_2071_I2SMD_MSB_JUSTIFIED << AW_PID_2071_I2SMD_START_BIT)

#define AW_PID_2071_I2SMD_LSB_JUSTIFIED	(2)
#define AW_PID_2071_I2SMD_LSB_JUSTIFIED_VALUE	\
	(AW_PID_2071_I2SMD_LSB_JUSTIFIED << AW_PID_2071_I2SMD_START_BIT)

#define AW_PID_2071_I2SMD_RESERVED	(3)
#define AW_PID_2071_I2SMD_RESERVED_VALUE	\
	(AW_PID_2071_I2SMD_RESERVED << AW_PID_2071_I2SMD_START_BIT)

#define AW_PID_2071_I2SMD_DEFAULT_VALUE	(0)
#define AW_PID_2071_I2SMD_DEFAULT	\
	(AW_PID_2071_I2SMD_DEFAULT_VALUE << AW_PID_2071_I2SMD_START_BIT)

/* I2SFS bit 7:6 (I2SCTRL 0x06) */
#define AW_PID_2071_I2SFS_START_BIT	(6)
#define AW_PID_2071_I2SFS_BITS_LEN	(2)
#define AW_PID_2071_I2SFS_MASK	\
	(~(((1<<AW_PID_2071_I2SFS_BITS_LEN)-1) << AW_PID_2071_I2SFS_START_BIT))

#define AW_PID_2071_I2SFS_16_BITS	(0)
#define AW_PID_2071_I2SFS_16_BITS_VALUE	\
	(AW_PID_2071_I2SFS_16_BITS << AW_PID_2071_I2SFS_START_BIT)

#define AW_PID_2071_I2SFS_20_BITS	(1)
#define AW_PID_2071_I2SFS_20_BITS_VALUE	\
	(AW_PID_2071_I2SFS_20_BITS << AW_PID_2071_I2SFS_START_BIT)

#define AW_PID_2071_I2SFS_24_BITS	(2)
#define AW_PID_2071_I2SFS_24_BITS_VALUE	\
	(AW_PID_2071_I2SFS_24_BITS << AW_PID_2071_I2SFS_START_BIT)

#define AW_PID_2071_I2SFS_32_BITS	(3)
#define AW_PID_2071_I2SFS_32_BITS_VALUE	\
	(AW_PID_2071_I2SFS_32_BITS << AW_PID_2071_I2SFS_START_BIT)

#define AW_PID_2071_I2SFS_DEFAULT_VALUE	(3)
#define AW_PID_2071_I2SFS_DEFAULT	\
	(AW_PID_2071_I2SFS_DEFAULT_VALUE << AW_PID_2071_I2SFS_START_BIT)

/* I2SBCK bit 5:4 (I2SCTRL 0x06) */
#define AW_PID_2071_I2SBCK_START_BIT	(4)
#define AW_PID_2071_I2SBCK_BITS_LEN	(2)
#define AW_PID_2071_I2SBCK_MASK	\
	(~(((1<<AW_PID_2071_I2SBCK_BITS_LEN)-1) << AW_PID_2071_I2SBCK_START_BIT))

#define AW_PID_2071_I2SBCK_32FS	(0)
#define AW_PID_2071_I2SBCK_32FS_VALUE	\
	(AW_PID_2071_I2SBCK_32FS << AW_PID_2071_I2SBCK_START_BIT)

#define AW_PID_2071_I2SBCK_48FS	(1)
#define AW_PID_2071_I2SBCK_48FS_VALUE	\
	(AW_PID_2071_I2SBCK_48FS << AW_PID_2071_I2SBCK_START_BIT)

#define AW_PID_2071_I2SBCK_64FS	(2)
#define AW_PID_2071_I2SBCK_64FS_VALUE	\
	(AW_PID_2071_I2SBCK_64FS << AW_PID_2071_I2SBCK_START_BIT)

#define AW_PID_2071_I2SBCK_RESERVED	(3)
#define AW_PID_2071_I2SBCK_RESERVED_VALUE	\
	(AW_PID_2071_I2SBCK_RESERVED << AW_PID_2071_I2SBCK_START_BIT)

#define AW_PID_2071_I2SBCK_DEFAULT_VALUE	(2)
#define AW_PID_2071_I2SBCK_DEFAULT	\
	(AW_PID_2071_I2SBCK_DEFAULT_VALUE << AW_PID_2071_I2SBCK_START_BIT)

/* I2SSR bit 3:0 (I2SCTRL 0x06) */
#define AW_PID_2071_I2SSR_START_BIT	(0)
#define AW_PID_2071_I2SSR_BITS_LEN	(4)
#define AW_PID_2071_I2SSR_MASK	\
	(~(((1<<AW_PID_2071_I2SSR_BITS_LEN)-1) << AW_PID_2071_I2SSR_START_BIT))

#define AW_PID_2071_I2SSR_8_KHZ	(0)
#define AW_PID_2071_I2SSR_8_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_8_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_11_KHZ	(1)
#define AW_PID_2071_I2SSR_11_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_11_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_12_KHZ	(2)
#define AW_PID_2071_I2SSR_12_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_12_KHZ << AW_PID_2071_I2SSR_START_BIT)

