LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
#define AW_PID_2071_I2SSR_16_KHZ	(3)
#define AW_PID_2071_I2SSR_16_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_16_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_22_KHZ	(4)
#define AW_PID_2071_I2SSR_22_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_22_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_24_KHZ	(5)
#define AW_PID_2071_I2SSR_24_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_24_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_32_KHZ	(6)
#define AW_PID_2071_I2SSR_32_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_32_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_44_KHZ	(7)
#define AW_PID_2071_I2SSR_44_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_44_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_48_KHZ	(8)
#define AW_PID_2071_I2SSR_48_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_48_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_96_KHZ	(9)
#define AW_PID_2071_I2SSR_96_KHZ_VALUE	\
	(AW_PID_2071_I2SSR_96_KHZ << AW_PID_2071_I2SSR_START_BIT)

#define AW_PID_2071_I2SSR_DEFAULT_VALUE	(8)
#define AW_PID_2071_I2SSR_DEFAULT	\
	(AW_PID_2071_I2SSR_DEFAULT_VALUE << AW_PID_2071_I2SSR_START_BIT)

/* default value of I2SCTRL (0x06) */
/* #define AW_PID_2071_I2SCTRL_DEFAULT		(0x94E8) */

/* I2SCFG1 (0x07) detail */
/* I2S_TX_SLOTVLD bit 15:12 (I2SCFG1 0x07) */
#define AW_PID_2071_I2S_TX_SLOTVLD_START_BIT	(12)
#define AW_PID_2071_I2S_TX_SLOTVLD_BITS_LEN	(4)
#define AW_PID_2071_I2S_TX_SLOTVLD_MASK	\
	(~(((1<<AW_PID_2071_I2S_TX_SLOTVLD_BITS_LEN)-1) << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT))

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_0	(0)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_0_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_0 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_1	(1)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_1_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_1 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_2	(2)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_2_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_2 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_3	(3)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_3 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_4	(4)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_4 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_5	(5)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_5 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_6	(6)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_6 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_7	(7)
#define AW_PID_2071_I2S_TX_SLOTVLD_SLOT_7_VALUE	\
	(AW_PID_2071_I2S_TX_SLOTVLD_SLOT_7 << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_TX_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_2071_I2S_TX_SLOTVLD_DEFAULT	\
	(AW_PID_2071_I2S_TX_SLOTVLD_DEFAULT_VALUE << AW_PID_2071_I2S_TX_SLOTVLD_START_BIT)

/* I2S_RXL_SLOTVLD bit 11:8 (I2SCFG1 0x07) */
#define AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT	(8)
#define AW_PID_2071_I2S_RXL_SLOTVLD_BITS_LEN	(4)
#define AW_PID_2071_I2S_RXL_SLOTVLD_MASK	\
	(~(((1<<AW_PID_2071_I2S_RXL_SLOTVLD_BITS_LEN)-1) << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT))

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_0	(0)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_0_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_0 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_1	(1)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_1_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_1 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_2	(2)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_2_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_2 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_3	(3)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_3 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_4	(4)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_4 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_5	(5)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_5 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_6	(6)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_6 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_7	(7)
#define AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_7_VALUE	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_SLOT_7 << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2071_I2S_RXL_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_2071_I2S_RXL_SLOTVLD_DEFAULT	\
	(AW_PID_2071_I2S_RXL_SLOTVLD_DEFAULT_VALUE << AW_PID_2071_I2S_RXL_SLOTVLD_START_BIT)

/* CFSEL bit 7:6 (I2SCFG1 0x07) */
#define AW_PID_2071_CFSEL_START_BIT	(6)
#define AW_PID_2071_CFSEL_BITS_LEN	(2)
#define AW_PID_2071_CFSEL_MASK	\
	(~(((1<<AW_PID_2071_CFSEL_BITS_LEN)-1) << AW_PID_2071_CFSEL_START_BIT))

#define AW_PID_2071_CFSEL_HAGC	(0)
#define AW_PID_2071_CFSEL_HAGC_VALUE	\
	(AW_PID_2071_CFSEL_HAGC << AW_PID_2071_CFSEL_START_BIT)

#define AW_PID_2071_CFSEL_IV_TXDOUT	(1)
#define AW_PID_2071_CFSEL_IV_TXDOUT_VALUE	\
	(AW_PID_2071_CFSEL_IV_TXDOUT << AW_PID_2071_CFSEL_START_BIT)

#define AW_PID_2071_CFSEL_IVBT_TXDOUT	(2)
#define AW_PID_2071_CFSEL_IVBT_TXDOUT_VALUE	\
	(AW_PID_2071_CFSEL_IVBT_TXDOUT << AW_PID_2071_CFSEL_START_BIT)

#define AW_PID_2071_CFSEL_RESERVED_FOR_IV_TXDOUT	(3)
#define AW_PID_2071_CFSEL_RESERVED_FOR_IV_TXDOUT_VALUE	\
	(AW_PID_2071_CFSEL_RESERVED_FOR_IV_TXDOUT << AW_PID_2071_CFSEL_START_BIT)

#define AW_PID_2071_CFSEL_DEFAULT_VALUE	(0)
#define AW_PID_2071_CFSEL_DEFAULT	\
	(AW_PID_2071_CFSEL_DEFAULT_VALUE << AW_PID_2071_CFSEL_START_BIT)

/* DRVSTREN bit 5 (I2SCFG1 0x07) */
#define AW_PID_2071_DRVSTREN_START_BIT	(5)
#define AW_PID_2071_DRVSTREN_BITS_LEN	(1)
#define AW_PID_2071_DRVSTREN_MASK	\
	(~(((1<<AW_PID_2071_DRVSTREN_BITS_LEN)-1) << AW_PID_2071_DRVSTREN_START_BIT))

