LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
#define AW_PID_2071_DRVSTREN_2MA	(0)
#define AW_PID_2071_DRVSTREN_2MA_VALUE	\
	(AW_PID_2071_DRVSTREN_2MA << AW_PID_2071_DRVSTREN_START_BIT)

#define AW_PID_2071_DRVSTREN_8MA	(1)
#define AW_PID_2071_DRVSTREN_8MA_VALUE	\
	(AW_PID_2071_DRVSTREN_8MA << AW_PID_2071_DRVSTREN_START_BIT)

#define AW_PID_2071_DRVSTREN_DEFAULT_VALUE	(1)
#define AW_PID_2071_DRVSTREN_DEFAULT	\
	(AW_PID_2071_DRVSTREN_DEFAULT_VALUE << AW_PID_2071_DRVSTREN_START_BIT)

/* DOHZ bit 4 (I2SCFG1 0x07) */
#define AW_PID_2071_DOHZ_START_BIT	(4)
#define AW_PID_2071_DOHZ_BITS_LEN	(1)
#define AW_PID_2071_DOHZ_MASK	\
	(~(((1<<AW_PID_2071_DOHZ_BITS_LEN)-1) << AW_PID_2071_DOHZ_START_BIT))

#define AW_PID_2071_DOHZ_ALL	(0)
#define AW_PID_2071_DOHZ_ALL_VALUE	\
	(AW_PID_2071_DOHZ_ALL << AW_PID_2071_DOHZ_START_BIT)

#define AW_PID_2071_DOHZ_HIZ	(1)
#define AW_PID_2071_DOHZ_HIZ_VALUE	\
	(AW_PID_2071_DOHZ_HIZ << AW_PID_2071_DOHZ_START_BIT)

#define AW_PID_2071_DOHZ_DEFAULT_VALUE	(1)
#define AW_PID_2071_DOHZ_DEFAULT	\
	(AW_PID_2071_DOHZ_DEFAULT_VALUE << AW_PID_2071_DOHZ_START_BIT)

/* FSYNC_TYPE bit 3 (I2SCFG1 0x07) */
#define AW_PID_2071_FSYNC_TYPE_START_BIT	(3)
#define AW_PID_2071_FSYNC_TYPE_BITS_LEN	(1)
#define AW_PID_2071_FSYNC_TYPE_MASK	\
	(~(((1<<AW_PID_2071_FSYNC_TYPE_BITS_LEN)-1) << AW_PID_2071_FSYNC_TYPE_START_BIT))

#define AW_PID_2071_FSYNC_TYPE_ONEMINUS_SLOT	(0)
#define AW_PID_2071_FSYNC_TYPE_ONEMINUS_SLOT_VALUE	\
	(AW_PID_2071_FSYNC_TYPE_ONEMINUS_SLOT << AW_PID_2071_FSYNC_TYPE_START_BIT)

#define AW_PID_2071_FSYNC_TYPE_ONEMINUS_BCK	(1)
#define AW_PID_2071_FSYNC_TYPE_ONEMINUS_BCK_VALUE	\
	(AW_PID_2071_FSYNC_TYPE_ONEMINUS_BCK << AW_PID_2071_FSYNC_TYPE_START_BIT)

#define AW_PID_2071_FSYNC_TYPE_DEFAULT_VALUE	(0)
#define AW_PID_2071_FSYNC_TYPE_DEFAULT	\
	(AW_PID_2071_FSYNC_TYPE_DEFAULT_VALUE << AW_PID_2071_FSYNC_TYPE_START_BIT)

/* I2SDOSEL bit 2 (I2SCFG1 0x07) */
#define AW_PID_2071_I2SDOSEL_START_BIT	(2)
#define AW_PID_2071_I2SDOSEL_BITS_LEN	(1)
#define AW_PID_2071_I2SDOSEL_MASK	\
	(~(((1<<AW_PID_2071_I2SDOSEL_BITS_LEN)-1) << AW_PID_2071_I2SDOSEL_START_BIT))

#define AW_PID_2071_I2SDOSEL_0	(0)
#define AW_PID_2071_I2SDOSEL_0_VALUE	\
	(AW_PID_2071_I2SDOSEL_0 << AW_PID_2071_I2SDOSEL_START_BIT)

#define AW_PID_2071_I2SDOSEL_NORMAL_DATA	(1)
#define AW_PID_2071_I2SDOSEL_NORMAL_DATA_VALUE	\
	(AW_PID_2071_I2SDOSEL_NORMAL_DATA << AW_PID_2071_I2SDOSEL_START_BIT)

#define AW_PID_2071_I2SDOSEL_DEFAULT_VALUE	(1)
#define AW_PID_2071_I2SDOSEL_DEFAULT	\
	(AW_PID_2071_I2SDOSEL_DEFAULT_VALUE << AW_PID_2071_I2SDOSEL_START_BIT)

/* I2SCHS bit 1 (I2SCFG1 0x07) */
#define AW_PID_2071_I2SCHS_START_BIT	(1)
#define AW_PID_2071_I2SCHS_BITS_LEN	(1)
#define AW_PID_2071_I2SCHS_MASK	\
	(~(((1<<AW_PID_2071_I2SCHS_BITS_LEN)-1) << AW_PID_2071_I2SCHS_START_BIT))

#define AW_PID_2071_I2SCHS_LEFT	(0)
#define AW_PID_2071_I2SCHS_LEFT_VALUE	\
	(AW_PID_2071_I2SCHS_LEFT << AW_PID_2071_I2SCHS_START_BIT)

#define AW_PID_2071_I2SCHS_RIGHT	(1)
#define AW_PID_2071_I2SCHS_RIGHT_VALUE	\
	(AW_PID_2071_I2SCHS_RIGHT << AW_PID_2071_I2SCHS_START_BIT)

#define AW_PID_2071_I2SCHS_DEFAULT_VALUE	(0)
#define AW_PID_2071_I2SCHS_DEFAULT	\
	(AW_PID_2071_I2SCHS_DEFAULT_VALUE << AW_PID_2071_I2SCHS_START_BIT)

/* I2STXEN bit 0 (I2SCFG1 0x07) */
#define AW_PID_2071_I2STXEN_START_BIT	(0)
#define AW_PID_2071_I2STXEN_BITS_LEN	(1)
#define AW_PID_2071_I2STXEN_MASK	\
	(~(((1<<AW_PID_2071_I2STXEN_BITS_LEN)-1) << AW_PID_2071_I2STXEN_START_BIT))

#define AW_PID_2071_I2STXEN_DISABLE	(0)
#define AW_PID_2071_I2STXEN_DISABLE_VALUE	\
	(AW_PID_2071_I2STXEN_DISABLE << AW_PID_2071_I2STXEN_START_BIT)

#define AW_PID_2071_I2STXEN_ENABLE	(1)
#define AW_PID_2071_I2STXEN_ENABLE_VALUE	\
	(AW_PID_2071_I2STXEN_ENABLE << AW_PID_2071_I2STXEN_START_BIT)

#define AW_PID_2071_I2STXEN_DEFAULT_VALUE	(0)
#define AW_PID_2071_I2STXEN_DEFAULT	\
	(AW_PID_2071_I2STXEN_DEFAULT_VALUE << AW_PID_2071_I2STXEN_START_BIT)

/* default value of I2SCFG1 (0x07) */
/* #define AW_PID_2071_I2SCFG1_DEFAULT		(0x0034) */

/* HAGCCFG1 (0x09) detail */
/* RVTH bit 15:8 (HAGCCFG1 0x09) */
#define AW_PID_2071_RVTH_START_BIT	(8)
#define AW_PID_2071_RVTH_BITS_LEN	(8)
#define AW_PID_2071_RVTH_MASK	\
	(~(((1<<AW_PID_2071_RVTH_BITS_LEN)-1) << AW_PID_2071_RVTH_START_BIT))

#define AW_PID_2071_RVTH_DEFAULT_VALUE	(0x39)
#define AW_PID_2071_RVTH_DEFAULT	\
	(AW_PID_2071_RVTH_DEFAULT_VALUE << AW_PID_2071_RVTH_START_BIT)

/* AVTH bit 7:0 (HAGCCFG1 0x09) */
#define AW_PID_2071_AVTH_START_BIT	(0)
#define AW_PID_2071_AVTH_BITS_LEN	(8)
#define AW_PID_2071_AVTH_MASK	\
	(~(((1<<AW_PID_2071_AVTH_BITS_LEN)-1) << AW_PID_2071_AVTH_START_BIT))

#define AW_PID_2071_AVTH_DEFAULT_VALUE	(0x40)
#define AW_PID_2071_AVTH_DEFAULT	\
	(AW_PID_2071_AVTH_DEFAULT_VALUE << AW_PID_2071_AVTH_START_BIT)

/* default value of HAGCCFG1 (0x09) */
/* #define AW_PID_2071_HAGCCFG1_DEFAULT		(0x3940) */

/* HAGCCFG2 (0x0A) detail */
/* ATTH bit 15:0 (HAGCCFG2 0x0A) */
#define AW_PID_2071_ATTH_START_BIT	(0)
#define AW_PID_2071_ATTH_BITS_LEN	(16)
#define AW_PID_2071_ATTH_MASK	\
	(~(((1<<AW_PID_2071_ATTH_BITS_LEN)-1) << AW_PID_2071_ATTH_START_BIT))

#define AW_PID_2071_ATTH_RESERVED	(0)
#define AW_PID_2071_ATTH_RESERVED_VALUE	\
	(AW_PID_2071_ATTH_RESERVED << AW_PID_2071_ATTH_START_BIT)

#define AW_PID_2071_ATTH_DEFAULT_VALUE	(0x0030)
#define AW_PID_2071_ATTH_DEFAULT	\
	(AW_PID_2071_ATTH_DEFAULT_VALUE << AW_PID_2071_ATTH_START_BIT)

/* default value of HAGCCFG2 (0x0A) */
/* #define AW_PID_2071_HAGCCFG2_DEFAULT		(0x0030) */

/* HAGCCFG3 (0x0B) detail */
/* RTTH bit 15:0 (HAGCCFG3 0x0B) */
#define AW_PID_2071_RTTH_START_BIT	(0)
#define AW_PID_2071_RTTH_BITS_LEN	(16)
#define AW_PID_2071_RTTH_MASK	\
	(~(((1<<AW_PID_2071_RTTH_BITS_LEN)-1) << AW_PID_2071_RTTH_START_BIT))

#define AW_PID_2071_RTTH_RESERVED	(0)
#define AW_PID_2071_RTTH_RESERVED_VALUE	\
	(AW_PID_2071_RTTH_RESERVED << AW_PID_2071_RTTH_START_BIT)

#define AW_PID_2071_RTTH_DEFAULT_VALUE	(0x01E0)
#define AW_PID_2071_RTTH_DEFAULT	\
	(AW_PID_2071_RTTH_DEFAULT_VALUE << AW_PID_2071_RTTH_START_BIT)

/* default value of HAGCCFG3 (0x0B) */
/* #define AW_PID_2071_HAGCCFG3_DEFAULT		(0x01E0) */

/* HAGCCFG4 (0x0C) detail */
/* MPD_DSMO_ZCNT bit 13:10 (HAGCCFG4 0x0C) */
#define AW_PID_2071_MPD_DSMO_ZCNT_START_BIT	(10)
#define AW_PID_2071_MPD_DSMO_ZCNT_BITS_LEN	(4)
#define AW_PID_2071_MPD_DSMO_ZCNT_MASK	\
	(~(((1<<AW_PID_2071_MPD_DSMO_ZCNT_BITS_LEN)-1) << AW_PID_2071_MPD_DSMO_ZCNT_START_BIT))

#define AW_PID_2071_MPD_DSMO_ZCNT_DEFAULT_VALUE	(0)
#define AW_PID_2071_MPD_DSMO_ZCNT_DEFAULT	\
	(AW_PID_2071_MPD_DSMO_ZCNT_DEFAULT_VALUE << AW_PID_2071_MPD_DSMO_ZCNT_START_BIT)

/* DSM_MPD_BYP bit 9 (HAGCCFG4 0x0C) */
#define AW_PID_2071_DSM_MPD_BYP_START_BIT	(9)
#define AW_PID_2071_DSM_MPD_BYP_BITS_LEN	(1)
#define AW_PID_2071_DSM_MPD_BYP_MASK	\
	(~(((1<<AW_PID_2071_DSM_MPD_BYP_BITS_LEN)-1) << AW_PID_2071_DSM_MPD_BYP_START_BIT))

