LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263H/aw882xx_pid_2071_reg.h
#define AW_PID_2071_DSM_MPD_BYP_WORK	(0)
#define AW_PID_2071_DSM_MPD_BYP_WORK_VALUE	\
	(AW_PID_2071_DSM_MPD_BYP_WORK << AW_PID_2071_DSM_MPD_BYP_START_BIT)

#define AW_PID_2071_DSM_MPD_BYP_BYPASS	(1)
#define AW_PID_2071_DSM_MPD_BYP_BYPASS_VALUE	\
	(AW_PID_2071_DSM_MPD_BYP_BYPASS << AW_PID_2071_DSM_MPD_BYP_START_BIT)

#define AW_PID_2071_DSM_MPD_BYP_DEFAULT_VALUE	(1)
#define AW_PID_2071_DSM_MPD_BYP_DEFAULT	\
	(AW_PID_2071_DSM_MPD_BYP_DEFAULT_VALUE << AW_PID_2071_DSM_MPD_BYP_START_BIT)

/* AGC_MPD_BYP bit 8 (HAGCCFG4 0x0C) */
#define AW_PID_2071_AGC_MPD_BYP_START_BIT	(8)
#define AW_PID_2071_AGC_MPD_BYP_BITS_LEN	(1)
#define AW_PID_2071_AGC_MPD_BYP_MASK	\
	(~(((1<<AW_PID_2071_AGC_MPD_BYP_BITS_LEN)-1) << AW_PID_2071_AGC_MPD_BYP_START_BIT))

#define AW_PID_2071_AGC_MPD_BYP_WORK	(0)
#define AW_PID_2071_AGC_MPD_BYP_WORK_VALUE	\
	(AW_PID_2071_AGC_MPD_BYP_WORK << AW_PID_2071_AGC_MPD_BYP_START_BIT)

#define AW_PID_2071_AGC_MPD_BYP_BYPASS	(1)
#define AW_PID_2071_AGC_MPD_BYP_BYPASS_VALUE	\
	(AW_PID_2071_AGC_MPD_BYP_BYPASS << AW_PID_2071_AGC_MPD_BYP_START_BIT)

#define AW_PID_2071_AGC_MPD_BYP_DEFAULT_VALUE	(1)
#define AW_PID_2071_AGC_MPD_BYP_DEFAULT	\
	(AW_PID_2071_AGC_MPD_BYP_DEFAULT_VALUE << AW_PID_2071_AGC_MPD_BYP_START_BIT)

/* HOLDTH bit 7:0 (HAGCCFG4 0x0C) */
#define AW_PID_2071_HOLDTH_START_BIT	(0)
#define AW_PID_2071_HOLDTH_BITS_LEN	(8)
#define AW_PID_2071_HOLDTH_MASK	\
	(~(((1<<AW_PID_2071_HOLDTH_BITS_LEN)-1) << AW_PID_2071_HOLDTH_START_BIT))

#define AW_PID_2071_HOLDTH_RESERVED	(0)
#define AW_PID_2071_HOLDTH_RESERVED_VALUE	\
	(AW_PID_2071_HOLDTH_RESERVED << AW_PID_2071_HOLDTH_START_BIT)

#define AW_PID_2071_HOLDTH_DEFAULT_VALUE	(0x64)
#define AW_PID_2071_HOLDTH_DEFAULT	\
	(AW_PID_2071_HOLDTH_DEFAULT_VALUE << AW_PID_2071_HOLDTH_START_BIT)

/* default value of HAGCCFG4 (0x0C) */
/* #define AW_PID_2071_HAGCCFG4_DEFAULT		(0x0364) */

/* HAGCST (0x10) detail */
/* SPK_GAIN_ST bit 10:8 (HAGCST 0x10) */
#define AW_PID_2071_SPK_GAIN_ST_START_BIT	(8)
#define AW_PID_2071_SPK_GAIN_ST_BITS_LEN	(3)
#define AW_PID_2071_SPK_GAIN_ST_MASK	\
	(~(((1<<AW_PID_2071_SPK_GAIN_ST_BITS_LEN)-1) << AW_PID_2071_SPK_GAIN_ST_START_BIT))

#define AW_PID_2071_SPK_GAIN_ST_6	(0)
#define AW_PID_2071_SPK_GAIN_ST_6_VALUE	\
	(AW_PID_2071_SPK_GAIN_ST_6 << AW_PID_2071_SPK_GAIN_ST_START_BIT)

#define AW_PID_2071_SPK_GAIN_ST_7	(1)
#define AW_PID_2071_SPK_GAIN_ST_7_VALUE	\
	(AW_PID_2071_SPK_GAIN_ST_7 << AW_PID_2071_SPK_GAIN_ST_START_BIT)

#define AW_PID_2071_SPK_GAIN_ST_10P6	(2)
#define AW_PID_2071_SPK_GAIN_ST_10P6_VALUE	\
	(AW_PID_2071_SPK_GAIN_ST_10P6 << AW_PID_2071_SPK_GAIN_ST_START_BIT)

#define AW_PID_2071_SPK_GAIN_ST_12	(3)
#define AW_PID_2071_SPK_GAIN_ST_12_VALUE	\
	(AW_PID_2071_SPK_GAIN_ST_12 << AW_PID_2071_SPK_GAIN_ST_START_BIT)

#define AW_PID_2071_SPK_GAIN_ST_14	(4)
#define AW_PID_2071_SPK_GAIN_ST_14_VALUE	\
	(AW_PID_2071_SPK_GAIN_ST_14 << AW_PID_2071_SPK_GAIN_ST_START_BIT)

#define AW_PID_2071_SPK_GAIN_ST_DEFAULT_VALUE	(0x4)
#define AW_PID_2071_SPK_GAIN_ST_DEFAULT	\
	(AW_PID_2071_SPK_GAIN_ST_DEFAULT_VALUE << AW_PID_2071_SPK_GAIN_ST_START_BIT)

/* BSTVOUT_ST bit 5:0 (HAGCST 0x10) */
#define AW_PID_2071_BSTVOUT_ST_START_BIT	(0)
#define AW_PID_2071_BSTVOUT_ST_BITS_LEN	(6)
#define AW_PID_2071_BSTVOUT_ST_MASK	\
	(~(((1<<AW_PID_2071_BSTVOUT_ST_BITS_LEN)-1) << AW_PID_2071_BSTVOUT_ST_START_BIT))

#define AW_PID_2071_BSTVOUT_ST_3P125V	(0)
#define AW_PID_2071_BSTVOUT_ST_3P125V_VALUE	\
	(AW_PID_2071_BSTVOUT_ST_3P125V << AW_PID_2071_BSTVOUT_ST_START_BIT)

#define AW_PID_2071_BSTVOUT_ST_3P25V	(1)
#define AW_PID_2071_BSTVOUT_ST_3P25V_VALUE	\
	(AW_PID_2071_BSTVOUT_ST_3P25V << AW_PID_2071_BSTVOUT_ST_START_BIT)

#define AW_PID_2071_BSTVOUT_ST_3P375V	(2)
#define AW_PID_2071_BSTVOUT_ST_3P375V_VALUE	\
	(AW_PID_2071_BSTVOUT_ST_3P375V << AW_PID_2071_BSTVOUT_ST_START_BIT)

#define AW_PID_2071_BSTVOUT_ST_3P5V	(3)
#define AW_PID_2071_BSTVOUT_ST_3P5V_VALUE	\
	(AW_PID_2071_BSTVOUT_ST_3P5V << AW_PID_2071_BSTVOUT_ST_START_BIT)

#define AW_PID_2071_BSTVOUT_ST_10P25V	(57)
#define AW_PID_2071_BSTVOUT_ST_10P25V_VALUE	\
	(AW_PID_2071_BSTVOUT_ST_10P25V << AW_PID_2071_BSTVOUT_ST_START_BIT)

#define AW_PID_2071_BSTVOUT_ST_DEFAULT_VALUE	(0)
#define AW_PID_2071_BSTVOUT_ST_DEFAULT	\
	(AW_PID_2071_BSTVOUT_ST_DEFAULT_VALUE << AW_PID_2071_BSTVOUT_ST_START_BIT)

/* default value of HAGCST (0x10) */
/* #define AW_PID_2071_HAGCST_DEFAULT		(0x0400) */

/* VBAT (0x12) detail */
/* VBAT_DET bit 9:0 (VBAT 0x12) */
#define AW_PID_2071_VBAT_DET_START_BIT	(0)
#define AW_PID_2071_VBAT_DET_BITS_LEN	(10)
#define AW_PID_2071_VBAT_DET_MASK	\
	(~(((1<<AW_PID_2071_VBAT_DET_BITS_LEN)-1) << AW_PID_2071_VBAT_DET_START_BIT))

#define AW_PID_2071_VBAT_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2071_VBAT_DET_DEFAULT	\
	(AW_PID_2071_VBAT_DET_DEFAULT_VALUE << AW_PID_2071_VBAT_DET_START_BIT)

/* default value of VBAT (0x12) */
/* #define AW_PID_2071_VBAT_DEFAULT		(0x0263) */

/* TEMP (0x13) detail */
/* TEMP_DET bit 9:0 (TEMP 0x13) */
#define AW_PID_2071_TEMP_DET_START_BIT	(0)
#define AW_PID_2071_TEMP_DET_BITS_LEN	(10)
#define AW_PID_2071_TEMP_DET_MASK	\
	(~(((1<<AW_PID_2071_TEMP_DET_BITS_LEN)-1) << AW_PID_2071_TEMP_DET_START_BIT))

#define AW_PID_2071_TEMP_DET_MINUS_40_DEGREE	(0x3D8)
#define AW_PID_2071_TEMP_DET_MINUS_40_DEGREE_VALUE	\
	(AW_PID_2071_TEMP_DET_MINUS_40_DEGREE << AW_PID_2071_TEMP_DET_START_BIT)

#define AW_PID_2071_TEMP_DET_0_DEGREE	(0x00)
#define AW_PID_2071_TEMP_DET_0_DEGREE_VALUE	\
	(AW_PID_2071_TEMP_DET_0_DEGREE << AW_PID_2071_TEMP_DET_START_BIT)

#define AW_PID_2071_TEMP_DET_1_DEGREE	(0x01)
#define AW_PID_2071_TEMP_DET_1_DEGREE_VALUE	\
	(AW_PID_2071_TEMP_DET_1_DEGREE << AW_PID_2071_TEMP_DET_START_BIT)

#define AW_PID_2071_TEMP_DET_25_DEGREE	(0x19)
#define AW_PID_2071_TEMP_DET_25_DEGREE_VALUE	\
	(AW_PID_2071_TEMP_DET_25_DEGREE << AW_PID_2071_TEMP_DET_START_BIT)

#define AW_PID_2071_TEMP_DET_55_DEGREE	(0x37)
#define AW_PID_2071_TEMP_DET_55_DEGREE_VALUE	\
	(AW_PID_2071_TEMP_DET_55_DEGREE << AW_PID_2071_TEMP_DET_START_BIT)

